{
"description": "Mada’in Tower\nDubai Marina\nUnited Arab Emirates\n\nMada’in Properties Mada’in Tower\nFurnishing - No information\nParking\nFloors - 4P + G + 64floors + Roof\n\nDubai Marina, a vibrant waterfront community known for its stunning architecture and upscale and upscale lifestyle, is home to the magnificent Mada'in Tower. This architectural masterpiece offers a range of luxurious living options, including Sea View 2 Bed Apartments, 3 and 4 Bed Sky Villas, Duplex units Golf View 1 and 2 Bed Apartments. Al Sharta street is a short road in one of the densest areas of Dubai, surrounded by skyscrapers with residential, hospitality and office functions from 80 to 100 floors such as Princess Tower, The Torch, Elite Residence, Cayan Tower. This incredibly high density is in contrast with the tranquillity of the street, both in term of vehicle and pedestrian movements.\n\nWhen it comes to retail and dining, Marina Retail Centre stands as a beacon of convenience and variety. restaurants, retail shops, and even a cozy coffee shops, making it your one-stop destination for all your shopping needs.\n\nDubai Marina is an iconic and prestigious waterfront community situated along the shoreline of Dubai. As one of the city's most sought-after neighborhoods, it offers a captivating blend of urban sophistication, leisure, and breathtaking views. \n\nThe centerpiece of Dubai Marina is the man-made canal, which stretches over three kilometers and is surrounded by a collection of stunning high-rise buildings and luxurious waterfront residences. This vibrant development is known for its modern architecture and impressive skyline, making it a distinctive landmark in the city. \n\nLiving in Dubai Marina offers residents a lifestyle of convenience and luxury. The community is home to a wide range of amenities, including world-class restaurants, upscale shopping malls, and trendy cafes. The iconic Marina Walk provides a delightful promenade for leisurely strolls, with various dining and entertainment options overlooking the tranquil waters. \n\nThe Dubai Marina Yacht Club further adds to the community's allure, attracting yacht enthusiasts and offering a picturesque setting for waterfront leisure and events. The marina's prime location ensures easy access to the Arabian Gulf, providing residents with the opportunity to enjoy water sports, yachting, and other maritime activities.\n\nDubai Marina is strategically connected to other parts of the city through its efficient transportation network, including the Dubai Metro and major highways. Its proximity to major business districts, entertainment centers, and renowned landmarks make it a preferred choice for residents and visitors alike.",
"price": [
  {
    "price": "AED 1,800,000",
    "footage": "N/A",
    "bedrooms": "1 bedroom"
  },
  {
    "price": "N/A",
    "footage": "N/A",
    "bedrooms": "2 bedroom"
  },
  {
    "price": "N/A",
    "footage": "N/A",
    "bedrooms": "3 bedroom"
  },
  {
    "price": "N/A",
    "footage": "N/A",
    "bedrooms": "4 bedroom"
  },
  {
    "price": "N/A",
    "footage": "N/A",
    "bedrooms": "Sky Villa 3 bedroom"
  },
  {
    "price": "N/A",
    "footage": "N/A",
    "bedrooms": "Sky Villa 4 bedroom"
  }
],
"amenities": [
  "Gym",
  "Kids Play Area",
  "Olympic Size Swimming Pool",
  "Sauna & Jacuzzi",
  "Outdoor Sitting Area",
  "Social Area"
],
"location": "Dubai Marina, United Arab Emirates"
}