{
  "description": "Avant Garde Residences by Skyline\n\nProject Completion: Q4 2026\n\nLocation: Jumeirah Village Circle (JVC), Dubai, United Arab Emirates\n\nFurnishing: No\n\nParking: N/A\n\nFloors: G+5P+18floors\n\nService Charge: 15 AED/sqft\n\nAvant Garde Residences is a meticulously designed development that offers spacious and well-appointed apartments. The apartments feature high-quality materials, fixtures, and fittings, as well as floor-to-ceiling windows and balconies for a bright and airy atmosphere. The building is designed to create a vibrant and self-sufficient community with a wide range of amenities. The contemporary architectural design of the building incorporates subtle curves inspired by the Arabian desert and gulf. The interiors of the apartments are designed with a focus on natural materials and color palettes to create a tranquil ambiance. The kitchen is equipped with high-quality appliances branded by Teca. Avant Garde Residences is located in Jumeirah Village Circle, a thriving community that offers a harmonious blend of modern living and natural beauty. The community features tree-lined streets, tranquil parks, and spacious villas and apartments. It provides a peaceful escape from the hustle and bustle of city life while still being conveniently located within Dubai.",
  "price": [
    {
      "price": "AED 650,000",
      "footage": "389 sqft / 36 m²",
      "bedrooms": "Studio"
    },
    {
      "price": "AED 950,000",
      "footage": "849 sqft / 79 m²",
      "bedrooms": "1 bedroom"
    },
    {
      "price": "AED 1,500,000",
      "footage": "1352 sqft / 126 m²",
      "bedrooms": "2 bedroom"
    }
  ],
  "amenities": [
    "Communal Workspace",
    "Sunken Poolside Seating",
    "Infinity Swimming Pool",
    "Baja Shelf",
    "Fully Equipped Gym",
    "Outdoor Gym",
    "Silent Rooftop Cinema",
    "Children’s Pool",
    "Children’s Splash Park",
    "Indoor Children’s Play Area",
    "Outdoor Children’s Play Area",
    "Multipurpose Hall and Gameroom",
    "Rooftop Garden",
    "Landscaped Gardens",
    "BBQ Area",
    "Resident's Lounge"
  ],
  "location": "Jumeirah Village Circle (JVC), Dubai, United Arab Emirates"
}